{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"heightinmeters:0": {"name": "heightinmeters:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "hadasthma:0": {"name": "hadasthma:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "raceethnicitycategory:0": {"name": "raceethnicitycategory:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "sex:0": {"name": "sex:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "difficultyconcentrating:0": {"name": "difficultyconcentrating:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "lastcheckuptime:0": {"name": "lastcheckuptime:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "difficultydressingbathing:0": {"name": "difficultydressingbathing:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "deaforhardofhearing:0": {"name": "deaforhardofhearing:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "difficultywalking:0": {"name": "difficultywalking:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "blindorvisiondifficulty:0": {"name": "blindorvisiondifficulty:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "removedteeth:0": {"name": "removedteeth:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "difficultyerrands:0": {"name": "difficultyerrands:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "hivtesting:0": {"name": "hivtesting:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "highrisklastyear:0": {"name": "highrisklastyear:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "hadkidneydisease:0": {"name": "hadkidneydisease:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "pneumovaxever:0": {"name": "pneumovaxever:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "sleephours:0": {"name": "sleephours:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "state:0": {"name": "state:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "bmi:0": {"name": "bmi:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "physicalhealthdays:0": {"name": "physicalhealthdays:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "unknown:0": {"name": "unknown:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 16399}, "mentalhealthdays:0": {"name": "mentalhealthdays:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "smokerstatus:0": {"name": "smokerstatus:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "alcoholdrinkers:0": {"name": "alcoholdrinkers:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "hadcopd:0": {"name": "hadcopd:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "tetanuslast10tdap:0": {"name": "tetanuslast10tdap:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "physicalactivities:0": {"name": "physicalactivities:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "ecigaretteusage:0": {"name": "ecigaretteusage:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "chestscan:0": {"name": "chestscan:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "haddiabetes:0": {"name": "haddiabetes:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "hadskincancer:0": {"name": "hadskincancer:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "generalhealth:0": {"name": "generalhealth:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "agecategory:0": {"name": "agecategory:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "fluvaxlast12:0": {"name": "fluvaxlast12:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "hadstroke:0": {"name": "hadstroke:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "haddepressivedisorder:0": {"name": "haddepressivedisorder:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "hadarthritis:0": {"name": "hadarthritis:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "covidpos:0": {"name": "covidpos:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "agecategory", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "alcoholdrinkers", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "blindorvisiondifficulty", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "bmi", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "chestscan", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "covidpos", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "deaforhardofhearing", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "difficultyconcentrating", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "difficultydressingbathing", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "difficultyerrands", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "difficultywalking", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "ecigaretteusage", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "fluvaxlast12", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "generalhealth", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "hadarthritis", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "hadasthma", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "hadcopd", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "haddepressivedisorder", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "haddiabetes", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "hadkidneydisease", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "hadskincancer", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "hadstroke", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "heightinmeters", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "highrisklastyear", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "hivtesting", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "lastcheckuptime", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "mentalhealthdays", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "physicalactivities", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "physicalhealthdays", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pneumovaxever", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "raceethnicitycategory", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "removedteeth", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "sex", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "sleephours", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "smokerstatus", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "state", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT64"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "tetanuslast10tdap", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown", "op": "Placeholder", "attr": {"dtype": {"type": "DT_RESOURCE"}, "shape": {"shape": {}}}}, {"name": "Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40", "op": "NoOp", "input": ["^agecategory", "^alcoholdrinkers", "^difficultywalking", "^ecigaretteusage", "^fluvaxlast12", "^generalhealth", "^hivtesting", "^hadarthritis", "^hadasthma", "^hadcopd", "^haddepressivedisorder", "^haddiabetes", "^bmi", "^hadkidneydisease", "^hadskincancer", "^hadstroke", "^heightinmeters", "^highrisklastyear", "^lastcheckuptime", "^mentalhealthdays", "^physicalactivities", "^physicalhealthdays", "^pneumovaxever", "^blindorvisiondifficulty", "^raceethnicitycategory", "^removedteeth", "^sex", "^sleephours", "^smokerstatus", "^state", "^tetanuslast10tdap", "^unknown", "^chestscan", "^covidpos", "^deaforhardofhearing", "^difficultyconcentrating", "^difficultydressingbathing", "^difficultyerrands"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_24", "op": "Cast", "input": ["agecategory", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_25", "op": "Cast", "input": ["alcoholdrinkers", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_15", "op": "Cast", "input": ["blindorvisiondifficulty", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_22", "op": "Cast", "input": ["chestscan", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_31", "op": "Cast", "input": ["covidpos", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_14", "op": "Cast", "input": ["deaforhardofhearing", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_16", "op": "Cast", "input": ["difficultyconcentrating", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_18", "op": "Cast", "input": ["difficultydressingbathing", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_19", "op": "Cast", "input": ["difficultyerrands", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_17", "op": "Cast", "input": ["difficultywalking", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_21", "op": "Cast", "input": ["ecigaretteusage", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_27", "op": "Cast", "input": ["fluvaxlast12", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_2", "op": "Cast", "input": ["generalhealth", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_26", "op": "Cast", "input": ["hivtesting", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_12", "op": "Cast", "input": ["hadarthritis", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_7", "op": "Cast", "input": ["hadasthma", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_9", "op": "Cast", "input": ["hadcopd", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_10", "op": "Cast", "input": ["haddepressivedisorder", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_13", "op": "Cast", "input": ["haddiabetes", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_11", "op": "Cast", "input": ["hadkidneydisease", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_8", "op": "Cast", "input": ["hadskincancer", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_6", "op": "Cast", "input": ["hadstroke", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_30", "op": "Cast", "input": ["highrisklastyear", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_3", "op": "Cast", "input": ["lastcheckuptime", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_4", "op": "Cast", "input": ["physicalactivities", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_28", "op": "Cast", "input": ["pneumovaxever", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_23", "op": "Cast", "input": ["raceethnicitycategory", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_5", "op": "Cast", "input": ["removedteeth", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_1", "op": "Cast", "input": ["sex", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_20", "op": "Cast", "input": ["smokerstatus", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "op": "Cast", "input": ["state", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_29", "op": "Cast", "input": ["tetanuslast10tdap", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/input_control_node/_40"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/stack", "op": "Pack", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_24", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_25", "bmi", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_15", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_22", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_31", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_14", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_16", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_18", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_19", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_17", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_21", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_27", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_2", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_26", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_12", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_7", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_9", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_10", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_13", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_11", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_8", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_6", "heightinmeters", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_30", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_3", "mentalhealthdays", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_4", "physicalhealthdays", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_28", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_23", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_5", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_1", "sleephours", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_20", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall/Cast_29"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "37"}, "axis": {"i": "1"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/inference_op", "op": "SimpleMLInferenceOpWithHandle", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/stack", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/Const", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/Const_1", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/RaggedConstant/values", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/RaggedConstant/Const", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/RaggedConstant/Const_1", "unknown"], "attr": {"dense_output_dim": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/inference_op", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2"], "attr": {"end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "1"}, "shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "modelInitializer": {"node": [{"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "17004", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "op": "SimpleMLCreateModelResource", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8"], "attr": {"container": {"s": ""}, "_has_manual_control_dependencies": {"b": true}, "shared_name": {"s": "c2ltcGxlX21sX21vZGVsX2Y5NGVlZDc1LTViZTQtNGU1Yi1hMTdkLWVhM2VmMmZiMjhkMl9sb2FkXzE1NTc3"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^17004", "^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["17004", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12"], "attr": {"replace_global": {"b": true}, "pattern": {"s": "OWZjODA5Nzc4MGViNGRiNGRvbmU="}, "rewrite": {"s": ""}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle", "op": "SimpleMLLoadModelFromPathWithHandle", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace"], "attr": {"file_prefix": {"s": "OWZjODA5Nzc4MGViNGRiNA=="}, "_has_manual_control_dependencies": {"b": true}, "output_types": {"list": {}}, "allow_slow_inference": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_7", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_7"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1766}}, "initializerSignature": {"outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 16399}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/Const", "shape": [0, 0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/Const_1", "shape": [0, 0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/RaggedConstant/values", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/RaggedConstant/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/RaggedConstant/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model_1/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "17004", "shape": [], "dtype": "string"}]}]}